Tekla.Structures.ModelInternal.dotModStampCompare_t.TypeEnum
Modstamp comparison type

Tekla.Structures.ModelInternal.dotModStampCompare_t.TypeEnum.OBJECT_MOD
Compare object mod (ObjectGuid used)

Tekla.Structures.ModelInternal.dotModStampCompare_t.TypeEnum.MODEL_OPTIONS_MOD
Compare model options mod

Tekla.Structures.ModelInternal.dotModStampCompare_t.TypeEnum.DRAWING_OPTIONS_MOD
Compare drawing options mod

Tekla.Structures.ModelInternal.dotModStampCompare_t.TypeEnum.MATERIAL_CATALOG_MOD
Compare material catalog mod

Tekla.Structures.ModelInternal.dotModStampCompare_t.TypeEnum.PROFILE_CATALOG_MOD
Compare profile catalog mod

Tekla.Structures.ModelInternal.dotModStampCompare_t.TypeEnum.CUSTOM_PROPERTIES_MOD
Compare custom properties mod

Tekla.Structures.ModelInternal.dotModStampCompare_t.TypeEnum.BOLT_CATALOG_MOD
Compare bolt catalog mod

Tekla.Structures.ModelInternal.dotModStampCompare_t.TypeEnum.BOLT_ASSEMBLY_CATALOG_MOD
Compare bolt assemlby catalog mod

Tekla.Structures.ModelInternal.dotModStampCompare_t.TypeEnum.DRAWINGS_MOD
Compare bolt assemlby catalog mod